[
    {
        "year": "1973",
        "imgSrc": "assets/tastey-archive-images/friends.jpeg",
        "event": "9 friends brainstorm an idea",
        "description": "In the fortunate year of 1973. During the autumn period.. a group of 9 friends agreed that their generation, 'Generation X' was behind in the food aspect and decided to make a restaurant startup that aimed to reinvent food and named the idea 'Food from Dreams' initially"
    }, 
    {
        "year": "1974",
        "imgSrc": "assets/tastey-archive-images/kitchen.jpeg",
        "event": "A year after!",
        "description": "They waited a year before finally agreeing to collaborate and experiment the startup idea. They were very good cooks so they decided to dive in, No staffs or extra manpower but just them in a rented building yielding nothing but will power, but little did they know, that it will lead them to the frontlines of the food world"
    },
    {
        "year": "1976",
        "imgSrc": "assets/tastey-archive-images/first-customer.jpeg",
        "event": "The name 'Tastey'",
        "description": "They were in dire need of an actual business name as the idea started to look feasible. Then came a customer who wanted to try their special at the time 'The infamous Jollof Rice Special' and it is said that after his very first taste, he yelled 'Tastey!!!', then they looked alive in unison knowing that was it..."
    }, 
    {
        "year": "1981",
        "imgSrc": "assets/tastey-archive-images/first-restaurant.jpeg",
        "event": "Our first Restaurant",
        "description": "Sales had been going smoothly over the last couple of years and then they decided to take a big leap and stop renting the building they were currently using and just purchase it, David and Lazzy managed to convince all that were'nt on par with the idea and so they took the leap and landed the Lagos Branch"
    },
    {
        "year": "1985",
        "imgSrc": "assets/tastey-archive-images/another-restaurant.jpeg",
        "event": "Another One!",
        "description": "Sales skyrocketed even beyond what they initially planned... and then Chisom spawned a thought, why not another? Kosi managed to convince everyone this time so they all agreed after a brief thought session and then went for it and it gave rise to the PortHarcourt Branch making its predecessor branch the headquarters"
    },
    {
        "year": "1991",
        "imgSrc": "assets/tastey-archive-images/fame.jpeg",
        "event": "Widespread recognition",
        "description": "Tastey began to get more attention as our customers were known to leave excellent reviews which meant the Tastey dream was actualizing each day. Tastey meals leave a bright smile on the face of the yielder of the spoon that gets to touch it after every bite. The word spread far and wide and then expansion became nothing but a norm"
    },
    {
        "year": "1999",
        "imgSrc": "assets/tastey-archive-images/michelin-star.jpeg",
        "event": "The Century ends with A Michelin star &star;",
        "description": "The Michelin Star is is an award given to restaurants that demonstarte outstanding coooking, with up to three stars awareded for the hightest levels of execellence and Tastey was given a three star as the food was described as an exceptional cuisine"
    },
    {
        "year": "2002",
        "imgSrc": "assets/tastey-archive-images/greed.jpeg",
        "event": "The Breakout",
        "description": "This year was rather unfortunate. Humans, no matter the goal or situtation can be overcome by greed and Tastey noticed a flaw in its revenue to expense ratio as it was collapsing on itself and it happened to be the fault of two of the founders 'Charles and Ayanfe' so they decided to split and what was once 9 became 7"
    },
    {
        "year": "2007",
        "imgSrc": "assets/tastey-archive-images/fortune.jpeg",
        "event": "Nothing but Fortune",
        "description": "The Tastey Restaurant which was nothing but a shared idea had now sprouted to a global stage restaurant that has been at it for about 35 years and counting. They had at least a branch in over 64 countries and what were once a group of young bright minds were now gracing middle age with children of their own"
    },
    {
        "year": "2019",
        "imgSrc": "assets/tastey-archive-images/old-founders.jpeg",
        "event": "Next Generation",
        "description": "The 7 founders left slowly started to realize that they were simply losing in the game of age and decided that not everyone who starts something gets to end it... They had been shunning the idea to pass it on for a while but it seemed inevitable now so they came up with a system to handle management without their involvement in preparation for their retirements"
    }, 
    {
        "year": "2023",
        "imgSrc": "assets/tastey-archive-images/memory.jpeg",
        "event": "Looking Back",
        "description": "Now, let us peek into the crevices of memory lane for just a moment. Skeptics would often say... Dreams should not be mistaken for reality and the founders should ditch the idea as restaurants already existed then one of the Tastey founders 'Tobi' would respond, Leave the dreamer to enjoy his dream and focus on living until you can dream no more"
    }, 
    {
        "year": "2024",
        "imgSrc": "assets/tastey-archive-images/present.jpeg",
        "event": "Still Tastey",
        "description": "We are at the present day and Tastey is still a reality, a well-known restaurant globally serving food to millions of people every year. 'We will let the meals speak for themselves' literally as witness say the meals do whisper at first glance. Waiting?!, Try a Tastey meal now!, it really does tease your taste buds"
    }
]